12/data/attachments/dff043e8e115ea5b.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:sendInvitationRequest>
            <nif:username>Troy_they_Friend_55735_1</nif:username>
            <nif:friendToBeRequested>soap_friends_db3e76ae-7435-480c-8a61-666475832b79</nif:friendToBeRequested>
        </nif:sendInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>